In [1]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:password@localhost:3306/

In [2]:
%%sql
USE lastcourse;
SELECT * FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
7 rows affected.

[(1, 'Alice Johnson', 'HR', Decimal('60000.00')),
 (2, 'Bob Smith', 'HR', Decimal('70000.00')),
 (3, 'Charlie Brown', 'IT', Decimal('80000.00')),
 (4, 'David Wilson', 'IT', Decimal('90000.00')),
 (5, 'Eva Green', 'Sales', Decimal('50000.00')),
 (6, 'Frank White', 'Sales', Decimal('50000.00')),
 (7, 'Grace Black', 'IT', Decimal('80000.00'))]

In [3]:
%%sql
SELECT salary, 
    CASE
        WHEN salary > 75000 THEN "good salary"
        ELSE "bad salary" END AS "review salary"
FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[(Decimal('60000.00'), 'bad salary'),
 (Decimal('70000.00'), 'bad salary'),
 (Decimal('80000.00'), 'good salary'),
 (Decimal('90000.00'), 'good salary'),
 (Decimal('50000.00'), 'bad salary'),
 (Decimal('50000.00'), 'bad salary'),
 (Decimal('80000.00'), 'good salary')]

In [4]:
%%sql
SELECT salary,
    CASE 
        WHEN salary > 750000 THEN "GOOD"
        WHEN salary > 55000 THEN "MEDIUM"
        ELSE "BAD" END AS "review"
FROM employees3;

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[(Decimal('60000.00'), 'MEDIUM'),
 (Decimal('70000.00'), 'MEDIUM'),
 (Decimal('80000.00'), 'MEDIUM'),
 (Decimal('90000.00'), 'MEDIUM'),
 (Decimal('50000.00'), 'BAD'),
 (Decimal('50000.00'), 'BAD'),
 (Decimal('80000.00'), 'MEDIUM')]

In [9]:
%%sql
# electr 200> good 200<bad
SELECT category,sales,
    CASE 
        WHEN sales > 200 THEN "good"
        ELSE "BAD" END AS "SALES"
FROM data
WHERE category LIKE "electronics";

 * mysql+pymysql://root:***@localhost:3306/
7 rows affected.

[('Electronics', 150, 'BAD'),
 ('Electronics', 500, 'good'),
 ('Electronics', 360, 'good'),
 ('Electronics', 440, 'good'),
 ('Electronics', 570, 'good'),
 ('Electronics', 460, 'good'),
 ('Electronics', 400, 'good')]

In [5]:
%%sql
SELECT * FROM DATA;

 * mysql+pymysql://root:***@localhost:3306/
20 rows affected.

[(1, 'Sarah Lee', 'Mexico City', 'Electronics', 150, 1, 150),
 (2, 'Michael Wong', 'Toronto', 'Furniture', 300, 1, 300),
 (3, 'Emily Davis', 'San Francisco', 'Furniture', 150, 3, 450),
 (4, 'David Kim', 'Vancouver', 'Clothing', 50, 5, 250),
 (5, 'Sophia Patel', 'Tokyo', 'Electronics', 250, 2, 500),
 (6, 'Liam Nguyen', 'Mexico City', 'Furniture', 400, 1, 400),
 (7, 'Isabella Rossi', 'Toronto', 'Clothing', 75, 3, 225),
 (8, 'Ethan Müller', 'San Francisco', 'Electronics', 180, 2, 360),
 (9, 'Olivia Sato', 'Vancouver', 'Furniture', 350, 1, 350),
 (10, 'Noah Dupont', 'Tokyo', 'Clothing', 60, 4, 240),
 (11, 'Emma Hernandez', 'Mexico City', 'Electronics', 220, 2, 440),
 (12, 'Jacob Kowalski', 'Toronto', 'Furniture', 280, 2, 560),
 (13, 'Ava Morales', 'San Francisco', 'Clothing', 55, 5, 275),
 (14, 'William Tanaka', 'Vancouver', 'Electronics', 190, 3, 570),
 (15, 'Mia Dupuis', 'Tokyo', 'Furniture', 320, 1, 320),
 (16, 'Alexander Ivanov', 'Mexico City', 'Clothing', 65, 4, 260),
 (17, 'Isabella Garcia', 'Toronto', 'Electronics', 230, 2, 460),
 (18, 'Daniel Moreno', 'San Francisco', 'Furniture', 290, 2, 580),
 (19, 'Sophia Nguyen', 'Vancouver', 'Clothing', 70, 3, 210),
 (20, 'John Smith', 'Tokyo', 'Electronics', 200, 2, 400)]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [2]:
%%sql
use trail;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

 * mysql+pymysql://root:***@localhost:3306/
11 rows affected.

[('John', 'Doe', datetime.date(2015, 6, 1)),
 ('Jane', 'Smith', datetime.date(2018, 2, 15)),
 ('Alice', 'Johnson', datetime.date(2016, 3, 10)),
 ('Bob', 'Lee', datetime.date(2019, 4, 25)),
 ('Charlie', 'Brown', datetime.date(2017, 7, 30)),
 ('David', 'Wilson', datetime.date(2014, 11, 5)),
 ('Eve', 'Davis', datetime.date(2020, 9, 1)),
 ('Frank', 'Martinez', datetime.date(2020, 12, 15)),
 ('Grace', 'Garcia', datetime.date(2018, 5, 20)),
 ('Hank', 'Miller', datetime.date(2015, 2, 5)),
 ('Ivy', 'Taylor', datetime.date(2017, 9, 12))]

In [13]:
%%sql
drop table hr;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [14]:
%%sql
CREATE TABLE hr (
    employee_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    department VARCHAR(50),
    position VARCHAR(50),
    salary DECIMAL(10, 2),
    hire_date DATE,
    termination_date DATE
);


INSERT INTO hr (first_name, last_name, department, position, salary, hire_date, termination_date) VALUES
('Alice', 'Johnson', 'IT', 'Software Developer', 90000.00, '2025-05-10', '2025-07-20'),
('Bob', 'Lee', 'Sales', 'Sales Representative', 45000.00, '2025-07-05', NULL),
('Charlie', 'Brown', 'Marketing', 'Marketing Manager', 65000.00, '2025-06-20', NULL),
('David', 'Wilson', 'IT', 'System Administrator', 72000.00, '2025-06-25', NULL),
('Jack', 'Anderson', 'Finance', 'Financial Analyst', 62000.00, '2025-05-30', NULL),
('Kathy', 'Thomas', 'Sales', 'Sales Manager', 75000.00, '2025-06-01', NULL),
('Louis', 'Jackson', 'Marketing', 'Content Writer', 47000.00, '2025-06-25', '2025-07-15'),
('Tina', 'Adams', 'Finance', 'Auditor', 66000.00, '2025-05-10', NULL),
('Ursula', 'Scott', 'IT', 'Database Administrator', 92000.00, '2025-05-12', NULL),
('John', 'Doe', 'Sales', 'Sales Manager', 75000.00, '2015-06-01', NULL),
('Jane', 'Smith', 'HR', 'HR Specialist', 58000.00, '2018-02-15', NULL),
('Alice', 'Johnson', 'IT', 'Software Developer', 90000.00, '2016-03-10', '2022-08-15'),
('Bob', 'Lee', 'Sales', 'Sales Representative', 45000.00, '2019-04-25', NULL),
('Charlie', 'Brown', 'Marketing', 'Marketing Manager', 65000.00, '2017-07-30', NULL),
('David', 'Wilson', 'IT', 'System Administrator', 72000.00, '2014-11-05', NULL),
('Eve', 'Davis', 'Finance', 'Accountant', 55000.00, '2020-09-01', NULL),
('Frank', 'Martinez', 'Sales', 'Sales Representative', 48000.00, '2020-12-15', NULL),
('Grace', 'Garcia', 'Marketing', 'SEO Specialist', 52000.00, '2018-05-20', NULL),
('Hank', 'Miller', 'HR', 'HR Manager', 80000.00, '2015-02-05', NULL),
('Ivy', 'Taylor', 'IT', 'Network Engineer', 67000.00, '2017-09-12', NULL);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
20 rows affected.

[]

In [ ]:
%%sql

In [ ]:
%%sql